templates now are tidier and profile photo added
